---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarTrimExtendData.Dispose
source: html/030e9c7c-7be8-8554-751e-9cffc4264b8b.htm
---
# Autodesk.Revit.DB.Structure.RebarTrimExtendData.Dispose Method

Releases all resources used by the RebarTrimExtendData

## Syntax (C#)
```csharp
public void Dispose()
```